In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv('Data_preprocessing.csv')

In [5]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes

In [9]:
df.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [8]:
df['Country'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [12]:
df['Purchased'].unique()

array(['No', 'Yes'], dtype=object)

In [15]:
# filled age column
df['Age'].fillna(df['Age'].mean(), inplace = True)
df['Age'].head(10)

C:\Users\Admin\AppData\Local\Temp\ipykernel_3352\360162739.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace = True)

0    44.000000
1    27.000000
2    30.000000
3    38.000000
4    40.000000
5    35.000000
6    38.777778
7    48.000000
8    50.000000
9    37.000000
Name: Age, dtype: float64

In [16]:
#filled salary column
df['Salary'].fillna(df['Salary'].mean(), inplace = True)
df['Salary'].head(10)

C:\Users\Admin\AppData\Local\Temp\ipykernel_3352\4229329.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace = True)

0    72000.000000
1    48000.000000
2    54000.000000
3    61000.000000
4    63777.777778
5    58000.000000
6    52000.000000
7    79000.000000
8    83000.000000
9    67000.000000
Name: Salary, dtype: float64

In [17]:
# pip install scikit-learn

In [23]:
#data cleaning - using scikit learn
from sklearn.impute import SimpleImputer
#importing dataset
ds = pd.read_csv("Data_preprocessing.csv")

In [24]:
si = SimpleImputer(missing_values=np.nan, strategy='mean')
ds[["Age","Salary"]] = si.fit_transform(ds[["Age","Salary"]])
ds

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [27]:
#Example for scikit learn
from sklearn.linear_model import LinearRegression 
model = LinearRegression()

#sample data
x = [[1],[2],[3]]
y = [2,4,6]

#Training the model
model.fit(x,y)

#Predicting
print(model.predict([[4]]))

[8.]

In [28]:
ds['Country'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [29]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(sparse_output=False)
#sparse_output=False means you want the output as a Numpy array, not in sparse(compressed) format
#encode country column
encoded_data = ohe.fit_transform(ds[['Country']])
encoded_data

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [37]:
df.to_csv('Cleaned_Data_praprocessing.csv')